&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.НастройкаПодписи",,,,,, Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	
	Если Результат<>Неопределено Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		Накладная(ТабДок, ПараметрКоманды, Результат);
		
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Накладная(ТабДок, ПараметрКоманды, НастройкаПодписи)
	Документы.РеализацияТоваровУслуг.Накладная(ТабДок, ПараметрКоманды, НастройкаПодписи);
КонецПроцедуры






