
Процедура ПередЗаписью(Отказ)
	//Сообщить("ПередЗаписью в модуле объекта");
	//ФорматироватьНаименование();
	//
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = "Текст сообщения";
	////Сообщение.КлючДанных = Ссылка;
	//Сообщение.Поле = "Наименование";
	////Сообщение.ПутьКДанным = "Объект";
	//Сообщение.УстановитьДанные(ЭтотОбъект);
	//Сообщение.Сообщить();
	
КонецПроцедуры

Процедура ФорматироватьНаименование() Экспорт
	Наименование = СокрЛП(Наименование);
КонецПроцедуры
