
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстЗаголовок", Заголовок);
	Параметры.Свойство("ТекстСообщения", ТекстСообщения);
	Параметры.Свойство("ТекстГиперссылки", ТекстГиперссылки);
	Параметры.Свойство("СсылкаГиперссылки", СсылкаГиперссылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстГиперссылкиНажатие(Элемент, СтандартнаяОбработка)
	
	ПерейтиПоНавигационнойСсылке(СсылкаГиперссылки);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
