Процедура ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт

	Если СтруктураДействий.Свойство("ПересчитатьСумму") Тогда
	
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;	
	
	КонецЕсли;	

КонецПроцедуры

Процедура ПересчитатьЦенуПоСуммеВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт

	Если СтруктураДействий.Свойство("ПересчитатьЦенуПоСумме") Тогда
		Если ТекущаяСтрока.Количество = 0 Тогда
		    ТекущаяСтрока.Цена = 0;
		Иначе
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры
