
Функция ШаблонURL1ПолучитьДанныеПоНоменклатуре(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = ОбщегоНазначения.ПолучитьНоменклатуру();
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, "UTF-8", ИспользованиеByteOrderMark.Использовать);
	Возврат Ответ;
КонецФункции

Функция ИзучениеПередачиПараметровПолучитьНоменклатуруПоШтрихкоду(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Штрихкод = Запрос.ПараметрыURL["barcode"];
	СтрокаJSON = ОбщегоНазначения.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.Использовать);
	Возврат Ответ;
	
КонецФункции
