Функция ПолучитьСсылкуПредопределенного(Ссылка) Экспорт

	МетаданныеОбъекта = Ссылка.Метаданные();
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений["Справочник_"+МетаданныеОбъекта.Имя];
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда	
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений["Документ_"+МетаданныеОбъекта.Имя];
	КонецЕсли;

КонецФункции // ПолучитьСсылкуПредопределенного()
