Функция НеОтображатьДиалогУстановкиРасширения() Экспорт

	Возврат ХранилищеОбщихНастроек.Загрузить("УстановкаРасширения") = "НеНапоминать";	

КонецФункции // НеОтображатьДиалогУстановкиРасширения()

Функция ПолучитьНавигационнуюСсылкуФайла(Ссылка, Расширение, ИдентификаторФормы, ВсеФайлы = Ложь)  Экспорт

	Если ВсеФайлы или ПрисоединенныеФайлыСервер.ЭтоГрафическийФайл(Расширение) Тогда
		
		Если Ссылка.ТипХранения = Перечисления.ТипыХраненияФайлов.ВБазе Тогда
			Возврат ПолучитьДанныеИзБазы(Ссылка);
		Иначе	
		    Возврат ПолучитьДанныхИзКаталога(Ссылка, ИдентификаторФормы);
		КонецЕсли;
		
	КонецЕсли;	

	Возврат "";
	
КонецФункции // ПолучитьНавигационнуюСсылкуФайла()

Функция ПолучитьДанныхИзКаталога(Ссылка, ИдентификаторФормы)

	ПутьКФайлу = ПрисоединенныеФайлыСервер.ПолучитьПутьКФайлуНаСервере(Ссылка);
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);	
		Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);		
	КонецЕсли;

КонецФункции // ПолучитьДанныхИзКаталога()

Функция ПолучитьДанныеИзБазы(Ссылка)

	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("ПрисоединенныйФайл", Ссылка);
	КлючЗаписи = РегистрыСведений.ПрисоединенныеФайлы.СоздатьКлючЗаписи(ЗначениеКлюча);
	
	Возврат ПолучитьНавигационнуюСсылку(КлючЗаписи, "Хранилище");		
	
КонецФункции // ПолучитьДанныеИзБазы()










