
&НаКлиенте
Процедура УстановитьИПродолжить(Команда)
	
	НачатьУстановкуРасширенияРаботыСФайлами(Новый ОписаниеОповещения("УстановитьИПродолжитьЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИПродолжитьЗавершение(ДополнительныеПараметры) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("УстановитьИПродолжитьЗавершениеЗавершение", ЭтотОбъект));	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИПродолжитьЗавершениеЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		Закрыть("ОК");
	Иначе
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьБезУстановки(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеНапоминать(Команда)
	БольшеНеНапоминатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура БольшеНеНапоминатьНаСервере()
	
	ХранилищеОбщихНастроек.Сохранить("УстановкаРасширения", , "НеНапоминать");
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры







