Процедура ЗаполнитьЦенуПродажиВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт

	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи") Тогда
	
		ТекущаяСтрока.Цена = ОбщегоНазначенияСервер.ПолучитьЦенуНоменклатуры(СтруктураДействий.ЗаполнитьЦенуПродажи.Дата,
																			 СтруктураДействий.ЗаполнитьЦенуПродажи.ТипЦен,
																			 ТекущаяСтрока.Номенклатура);
	
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт
	
	ЗаполнитьЦенуПродажиВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьЦенуПоСуммеВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);

КонецПроцедуры
