
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыЗагрузки.Вставить("Фильтр", "Все файлы (*.*)|*.*");
	ПараметрыЗагрузки.Вставить("ОписаниеОповещенияЗавершения", Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект));
	
	ПрисоединенныеФайлыКлиент.ЗагрузитьФайл(ПараметрыЗагрузки);	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Результат Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ВладелецФайла", Владелец);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Адрес", Результат.Адрес);
		ПараметрыФормы.Вставить("ВыбранноеИмяФайла", Результат.ВыбранноеИмяФайла);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Справочник.ПрисоединенныеФайлы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Свойство("ВладелецФайла", Владелец);
	Параметры.Свойство("РежимВыбора", Элементы.Список.РежимВыбора);
	
КонецПроцедуры

